In [30]:
import pandas as pd

In [31]:
df = pd.read_csv('C:/Users/Ramsha Ahmed/Documents/student_performance.csv')

In [32]:
df.shape

(6, 7)

In [33]:
df.head()

    Name  Math  Science  English Gender   Age Grade
0   Asha  85.0     90.0      NaN      F  19.0     A
1   John  78.0     82.0     88.0      M   NaN     B
2   Ravi   NaN     70.0     75.0      M  20.0     C
3  Priya  92.0     95.0     94.0      F  19.0    A+
4    NaN  80.0     85.0     79.0      F  21.0     B

In [34]:
df.tail(2)

     Name  Math  Science  English Gender   Age Grade
4     NaN  80.0     85.0     79.0      F  21.0     B
5  Sohail  88.0      NaN     84.0      M  20.0     A

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Math     5 non-null      float64
 2   Science  5 non-null      float64
 3   English  5 non-null      float64
 4   Gender   6 non-null      object
 5   Age      5 non-null      float64
 6   Grade    6 non-null      object
dtypes: float64(4), object(3)
memory usage: 468.0+ bytes

In [36]:
#Count missing values in each column

print(df.isna().sum)

<bound method DataFrame.sum of     Name   Math  Science  English  Gender    Age  Grade
0  False  False    False     True   False  False  False
1  False  False    False    False   False   True  False
2  False   True    False    False   False  False  False
3  False  False    False    False   False  False  False
4   True  False    False    False   False  False  False
5  False  False     True    False   False  False  False>

In [37]:
#Drop rows where Name is missing

df = df.dropna(subset=['Name'])
print(df)

     Name  Math  Science  English Gender   Age Grade
0    Asha  85.0     90.0      NaN      F  19.0     A
1    John  78.0     82.0     88.0      M   NaN     B
2    Ravi   NaN     70.0     75.0      M  20.0     C
3   Priya  92.0     95.0     94.0      F  19.0    A+
5  Sohail  88.0      NaN     84.0      M  20.0     A

In [38]:
#Fill missing Math marks with average

df['Math'] = df['Math'].fillna(df['Math'].mean())
print(df)

     Name   Math  Science  English Gender   Age Grade
0    Asha  85.00     90.0      NaN      F  19.0     A
1    John  78.00     82.0     88.0      M   NaN     B
2    Ravi  85.75     70.0     75.0      M  20.0     C
3   Priya  92.00     95.0     94.0      F  19.0    A+
5  Sohail  88.00      NaN     84.0      M  20.0     A

In [39]:
#Fill missing Age with mode( most common values)

df['Age'] = df['Age'].fillna(df['Age'].mode()[0])
print(df)

     Name   Math  Science  English Gender   Age Grade
0    Asha  85.00     90.0      NaN      F  19.0     A
1    John  78.00     82.0     88.0      M  19.0     B
2    Ravi  85.75     70.0     75.0      M  20.0     C
3   Priya  92.00     95.0     94.0      F  19.0    A+
5  Sohail  88.00      NaN     84.0      M  20.0     A

In [40]:
#Rename Math --> Mathematics

df = df.rename(columns = {'Math': 'Mathematics'})
print(df)

     Name  Mathematics  Science  English Gender   Age Grade
0    Asha        85.00     90.0      NaN      F  19.0     A
1    John        78.00     82.0     88.0      M  19.0     B
2    Ravi        85.75     70.0     75.0      M  20.0     C
3   Priya        92.00     95.0     94.0      F  19.0    A+
5  Sohail        88.00      NaN     84.0      M  20.0     A

In [41]:
#Make all columns names lowercase

df.columns = df.columns.str.lower()
print(df)

     name  mathematics  science  english gender   age grade
0    Asha        85.00     90.0      NaN      F  19.0     A
1    John        78.00     82.0     88.0      M  19.0     B
2    Ravi        85.75     70.0     75.0      M  20.0     C
3   Priya        92.00     95.0     94.0      F  19.0    A+
5  Sohail        88.00      NaN     84.0      M  20.0     A

In [42]:
# Convert Age to integer

df['age'] = df['age'].astype(int)
print(df)

     name  mathematics  science  english gender  age grade
0    Asha        85.00     90.0      NaN      F   19     A
1    John        78.00     82.0     88.0      M   19     B
2    Ravi        85.75     70.0     75.0      M   20     C
3   Priya        92.00     95.0     94.0      F   19    A+
5  Sohail        88.00      NaN     84.0      M   20     A

In [43]:
# Ensure Grade os string

df['grade'] = df['grade'].astype(str)
print(df)

     name  mathematics  science  english gender  age grade
0    Asha        85.00     90.0      NaN      F   19     A
1    John        78.00     82.0     88.0      M   19     B
2    Ravi        85.75     70.0     75.0      M   20     C
3   Priya        92.00     95.0     94.0      F   19    A+
5  Sohail        88.00      NaN     84.0      M   20     A

In [44]:
#Check for duplicates

df.duplicated()

0    False
1    False
2    False
3    False
5    False
dtype: bool

In [45]:
df = df.drop_duplicates()
print(df)

     name  mathematics  science  english gender  age grade
0    Asha        85.00     90.0      NaN      F   19     A
1    John        78.00     82.0     88.0      M   19     B
2    Ravi        85.75     70.0     75.0      M   20     C
3   Priya        92.00     95.0     94.0      F   19    A+
5  Sohail        88.00      NaN     84.0      M   20     A

In [46]:
df['english'] = df['english'].fillna(df['english'].mean())
print(df)

     name  mathematics  science  english gender  age grade
0    Asha        85.00     90.0    85.25      F   19     A
1    John        78.00     82.0    88.00      M   19     B
2    Ravi        85.75     70.0    75.00      M   20     C
3   Priya        92.00     95.0    94.00      F   19    A+
5  Sohail        88.00      NaN    84.00      M   20     A

In [47]:
df['science'] = df['science'].fillna(df['science'].mean())
print(df)

     name  mathematics  science  english gender  age grade
0    Asha        85.00    90.00    85.25      F   19     A
1    John        78.00    82.00    88.00      M   19     B
2    Ravi        85.75    70.00    75.00      M   20     C
3   Priya        92.00    95.00    94.00      F   19    A+
5  Sohail        88.00    84.25    84.00      M   20     A

In [48]:
df['total_marks'] = df['mathematics'] + df['science'] + df['english']
print(df)

     name  mathematics  science  english gender  age grade  total_marks
0    Asha        85.00    90.00    85.25      F   19     A       260.25
1    John        78.00    82.00    88.00      M   19     B       248.00
2    Ravi        85.75    70.00    75.00      M   20     C       230.75
3   Priya        92.00    95.00    94.00      F   19    A+       281.00
5  Sohail        88.00    84.25    84.00      M   20     A       256.25

In [49]:
df['result'] = df['total_marks'].apply(lambda x: 'Pass' if x >= 180 else 'Fail')
print(df)

     name  mathematics  science  english gender  age grade  total_marks result
0    Asha        85.00    90.00    85.25      F   19     A       260.25   Pass
1    John        78.00    82.00    88.00      M   19     B       248.00   Pass
2    Ravi        85.75    70.00    75.00      M   20     C       230.75   Pass
3   Priya        92.00    95.00    94.00      F   19    A+       281.00   Pass
5  Sohail        88.00    84.25    84.00      M   20     A       256.25   Pass

In [50]:
#Drop rows where students scored less than 50 in science

df = df[df['science'] >= 50]
print(df)

     name  mathematics  science  english gender  age grade  total_marks result
0    Asha        85.00    90.00    85.25      F   19     A       260.25   Pass
1    John        78.00    82.00    88.00      M   19     B       248.00   Pass
2    Ravi        85.75    70.00    75.00      M   20     C       230.75   Pass
3   Priya        92.00    95.00    94.00      F   19    A+       281.00   Pass
5  Sohail        88.00    84.25    84.00      M   20     A       256.25   Pass

In [54]:
#Sort English by decending

df_sorted = df.sort_values(by = 'english', ascending = False)
print(df_sorted)

     name  mathematics  science  english gender  age grade  total_marks result
3   Priya        92.00    95.00    94.00      F   19    A+       281.00   Pass
1    John        78.00    82.00    88.00      M   19     B       248.00   Pass
0    Asha        85.00    90.00    85.25      F   19     A       260.25   Pass
5  Sohail        88.00    84.25    84.00      M   20     A       256.25   Pass
2    Ravi        85.75    70.00    75.00      M   20     C       230.75   Pass

In [55]:
#Average marks by gender

print(df.groupby('gender')[['mathematics','science','english']].mean())

        mathematics  science    english
gender
F         88.500000    92.50  89.625000
M         83.916667    78.75  82.333333

In [56]:
# Count studnets in each Grade

print(df['grade'].value_counts())

grade
A     2
B     1
C     1
A+    1
Name: count, dtype: int64

In [59]:
# Math percentage (out of 100)

df['math_percent'] = df['mathematics']/100 * 100

print(df)

     name  mathematics  science  english gender  age grade  total_marks  \
0    Asha        85.00    90.00    85.25      F   19     A       260.25
1    John        78.00    82.00    88.00      M   19     B       248.00
2    Ravi        85.75    70.00    75.00      M   20     C       230.75
3   Priya        92.00    95.00    94.00      F   19    A+       281.00
5  Sohail        88.00    84.25    84.00      M   20     A       256.25

  result  math_percent
0   Pass         85.00
1   Pass         78.00
2   Pass         85.75
3   Pass         92.00
5   Pass         88.00

In [69]:
#Age in months

df['age_in_months'] = df['age'] * 12
print(df)

     name  mathematics  science  english gender  age grade  total_marks  \
0    ASHA        85.00    90.00    85.25      F   19     a       260.25
1    JOHN        78.00    82.00    88.00      M   19     b       248.00
2    RAVI        85.75    70.00    75.00      M   20     c       230.75
3   PRIYA        92.00    95.00    94.00      F   19    a+       281.00
5  SOHAIL        88.00    84.25    84.00      M   20     a       256.25

  result  math_percent  age_in_months first_letter
0   Pass         85.00            228            A
1   Pass         78.00            228            J
2   Pass         85.75            240            R
3   Pass         92.00            228            P
5   Pass         88.00            240            S

In [64]:
# Convert names to uppercase

df['name'] = df['name'].str.upper()
print(df)

     name  mathematics  science  english gender  age grade  total_marks  \
0    ASHA        85.00    90.00    85.25      F   19     A       260.25
1    JOHN        78.00    82.00    88.00      M   19     B       248.00
2    RAVI        85.75    70.00    75.00      M   20     C       230.75
3   PRIYA        92.00    95.00    94.00      F   19    A+       281.00
5  SOHAIL        88.00    84.25    84.00      M   20     A       256.25

  result  math_percent  age_in_months
0   Pass         85.00            228
1   Pass         78.00            228
2   Pass         85.75            240
3   Pass         92.00            228
5   Pass         88.00            240

In [66]:
df['first_letter'] = df['name'].str[0]
print(df['first_letter'])

0    A
1    J
2    R
3    P
5    S
Name: first_letter, dtype: object

In [68]:
#Standardize grade to lowercase

df['grade'] = df['grade'].str.lower()
print(df)

     name  mathematics  science  english gender  age grade  total_marks  \
0    ASHA        85.00    90.00    85.25      F   19     a       260.25
1    JOHN        78.00    82.00    88.00      M   19     b       248.00
2    RAVI        85.75    70.00    75.00      M   20     c       230.75
3   PRIYA        92.00    95.00    94.00      F   19    a+       281.00
5  SOHAIL        88.00    84.25    84.00      M   20     a       256.25

  result  math_percent  age_in_months first_letter
0   Pass         85.00            228            A
1   Pass         78.00            228            J
2   Pass         85.75            240            R
3   Pass         92.00            228            P
5   Pass         88.00            240            S